---
kind: enumMember
id: F:Autodesk.Revit.DB.ColumnAttachmentJustification.Midpoint
enum: Autodesk.Revit.DB.ColumnAttachmentJustification
source: html/39a5a31b-dc66-8db0-1f12-07c22e3bac09.htm
---
# Autodesk.Revit.DB.ColumnAttachmentJustification.Midpoint

Extend the column until its midpoint contacts the target.